[
	{
		"Title": "01. Naoya Inoue",
		"Pic" : "Naoya_Inoue",
		"Division": "Bantamweight",
		"Des" : "The 29-year-old slugger nicknamed the Monster is living up to it—he’s 18-0 in world title fights—​and he is now at the top of the list. For the ultra-talented 118-pounder—who won the World Boxing Super Series after earning a unanimous decision over future Hall of Famer Nonito Donaire in our 2019 Fight of the Year—it was his performance in their rematch that boosted him to the top of the list. On June 7th, he stopped Donaire in the second round by TKO, instilling fear in one of the former nine-time world champion, and leaving no questions on who the top bantamweight fighter in the world is, but also who the pound-for-pound king in the sport is. The recent loss from Canelo Alvarez opened the door for a new fighter to take the top spot, and Inoue did just that in dominant fashion. There isn’t much that needs to be said about Inoue that hasn’t been already, he’s one of the most dominant fighters in recent memory, and he has earned his place amongst the best of the best.",
		"IsVisible" : false
	},
	{
		"Title": "02. Canelo Alvarez",
		"Pic" : "Canelo_Alvarez",
		"Division": "Super middleweight",
		"Des" : "Despite falling to Dimitry Bivol in his first loss since his 2013 loss to Floyd Mayweather, Alvarez remains near the top of the pound-for-pound rankings, just not at the very top. While the loss to Bivol was surprising, it was just the latest example of Alvarez daring to be great, moving into the light heavyweight division to try and win the WBA light heavyweight title after fighting his previous four fights in the super middleweight division. He has an upcoming mega-fight with Gennady Golovkin, which will mark the third installment in their trilogy. With five super middleweight titles on the line in that fight, Alvarez isn’t lowering the stakes of his matchups despite taking a recent loss, and if he conquers GGG once again, a rematch with Bivol could be on the horizon. There are plenty of rising contenders for the top sport in the pound-for-pound rankings, but Alvarez still remains in the discussion for that distinction. For the first time in nearly a decade, Alvarez has lost some of his luster, but he still shines as bright as any star in boxing today, with the best resume to match the star power.",
		"IsVisible" : false
	},
	{
		"Title": "03. Errol Spence Jr.",
		"Pic" : "Errol_Spence_Jr",
		"Division": "Welterweight",
		"Des" : "Adversity is nothing to Errol Spence Jr. After a terrifying car accident in 2019 that he was able to walk away from with minor injuries, Spence returned to the ring to the ring in December 2020 to fight Danny Garcia, and while he didn’t quite look like the powerhouse who had taken the welterweight division by storm to win the IBF and WBC titles, he dominated Garcia with relative ease. In 2021 he was scheduled to face Manny Pacquiao for the WBA (Super) welterweight title, but a torn retina sidelined him once again. Fast forward to April of this year, Spence once again entered the ring with more questions than answers in a fight against Yordenis Ugás for the WBA (Super) welterweight title that Ugás won while stepping in to replace Spence against Pacquiao. And for the first time since his 2019 title fight with Shawn Porter, Spence looked the part of the best welterweight fighter in the world, relentlessly attacking Ugás before winning by a 10th round TKO that left his opponent with a fractured orbital bone. There is no denying that Spence is on an upward trajectory after his latest showing, and he holds three of the four belts in the welterweight division, all of which he has won by taking them from the previous title holder. With wins over Kell Brook, Mikey Garcia, Shawn Porter, Danny Garcia and Ugás under his belt, there is no denying Spence’s resume at 147-pounds.",
		"IsVisible" : false
	},
	{
		"Title": "04. Terence Crawford",
		"Pic" : "Terence_Crawford",
		"Division": "Welterweight",
		"Des" : "When Terence Crawford senses he can end a fight and goes in for the kill, he never misses. And that’s precisely what happened in the 10th round of his showdown with Shawn Porter Nov. 20 of last year. If you were scoring at home, it was incredibly tough to put one fighter ahead of the other halfway through it. However, Crawford finally figured out his friend, landed some vicious body shots, and took care of business against the guy who entered the fight as one of the most rugged and tested welterweights in the world. In the end, Bud put Porter down twice on the canvas before Kenny Porter, Shawn’s father and trainer, stopped the fight in a slightly bizarre ending. Some will argue that Crawford looked more impressive in his win over Porter than Errol Spence Jr. did, but Crawford also was able to catch Porter three years after Spence had defeated him. “You see what I did compared to what he did,” Crawford said after the fight, which Spence was on hand to witness. The supremely skilled former undisputed junior welterweight champ often puts on scintillating performances—there’s nothing he can’t do in the ring—and truth be told the masses probably are underrating the 34-year-old’s greatness. Before the fight, Crawford told us he wanted his respect when it comes to the pound-for-pound rankings if he took care of Porter. He isn’t quite No. 1 yet, but a win over Spence in their impending super-fight would do more than enough to vault Crawford to the top spot, becoming an undisputed world champion in two weight classes.",
		"IsVisible" : false
	},
	{
		"Title": "05. Tyson Fury",
		"Pic" : "Tyson_Fury",
		"Division": "Heavyweight",
		"Des" : "The body of work that Fury has put together over the course of his career is Hall of Fame worthy, but when zooming in on the last five years in particular, he has become one of the biggest stars in boxing while also cementing his place as one of the best pound-for-pound fighters in the world. After an instant classic with Deontay Wilder in 2018, which resulted in a controversial draw, Fury has ripped off five straight wins, including two more over Wilder in decisive fashion to stake his claim as the world’s greatest active heavyweight fighter. His most recent knockout of Dillian Whyte in April was just the latest showcase of the lethal combination of skill, power and athleticism that Fury possesses. It’s unclear when or who Fury will fight next, if he does at all. But he remains one of the most entertaining and best fighters on the planet until he formally walks away from the sport, or is thoroughly outclassed by an opponent.",
		"IsVisible" : false
	},
	{
		"Title": "06. Oleksandr Usyk",
		"Pic" : "Oleksandr_Usyk",
		"Division": "Heavyweight",
		"Des" : "Oleksandr Usyk slides two spots in the rankings but it isn’t because of a lack of dominance. The 2012 Olympic gold medalist and the former undisputed cruiserweight champion became the unified heavyweight champion of the world in only his third fight in boxing’s most glamorous division. And he absolutely deserves his top-five ranking after a sterling performance against Anthony Joshua. Usyk thoroughly out-boxed AJ in front of 66,267 Joshua supporters at Tottenham Hotspur Stadium in the UK, earning a unanimous decision to capture three of the division’s four major belts. There was no doubt that Usyk was the clear winner—especially after that incredible 12th round where he came oh so close to knocking Joshua down. But Usyk buzzed AJ more than a few times throughout and displayed superior skills, looking nothing like the guy who gave us a couple of duds prior to that performance. While a rematch between the two hasn’t been solidified yet, it is expected to happen soon. And if it does, the heavyweight division could be moving one step closer towards a unified champion in the division depending on who the winner is.",
		"IsVisible" : false
	},
	{
		"Title": "07. Josh Taylor",
		"Pic" : "Josh_Taylor",
		"Division": "Light-welterweight",
		"Des" : "I moved Josh Taylor down a few spots after he suffered the first knockdown of his career and barely retained his four straps in a Feb. 26 bout with Jack Catterall gave the Tartan Tornado a major, major scare. But I can’t penalize Taylor too harshly for winning—albeit controversially via split decision. Two judges had it 114-111 and 113-112 for Taylor with the other rocking with a 113-112 score in favor of Catterall. I had it 113-112 for Taylor. Regardless of the underwhelming performance, Taylor is still one of only four undisputed champions in boxing currently, joined by Canelo Alvarez, Devin Haney, and Jermell Charlo. And while Taylor admitted he may have put too much pressure on himself heading into the showdown with Catterall—who deserves a ton of credit for nearly pulling off a big upset—Taylor remains undeniably the top 140-pounder in the world with victories over Jose Ramirez, Regis Prograis, Viktor Postol, and Ivan Baranchyk. It sounds like Taylor’s done as a super lightweight and that’s fine. What else can he do in the division… unless he wants a crack at Teófimo López? We’re 1,000 percent down for a Taylor-Terence Crawford mega-match at 147 if it can be made. Also, can we ban referee Marcus McDonnell from working a championship fight again, please? Horrific job by him.",
		"IsVisible" : false
	},
	{
		"Title": "08. Vasiliy Lomachenko",
		"Pic" : "Vasiliy_Lomachenko",
		"Division": "Lightweight",
		"Des" : "The 33-year-old Ukrainian was dropped from our top spot in late 2019 in favor of a certain individual becoming a champion in a fourth weight class. And he got dropped even further after suffering his second professional loss to Teófimo López in 2020. But his two bouts in 2021 showed that despite being old—in a division full of young stars—Lomachenko has yet to show his age and nobody else at lightweight can do the things he does in the ring. The three-division champ, who is one of the mesmerizing athletes in boxing, yet again boxed brilliantly as he dominated Richard Commey, a former lightweight champ, to earn an easy unanimous decision at Madison Square Garden Dec. 11. Currently, Lomachenko is helping his native country of Ukraine in their fight against Russia, but with Devin Haney disposing of George Kambosos to become the undisputed lightweight champion of the world, there is a super fight to be made between the two later this year if Lomachenko wants to step back in the ring. And if he were able to secure a win over Haney, he could vault back up these rankings.",
		"IsVisible" : false
	},
	{
		"Title": "09. Dmitry Bivol",
		"Pic" : "Dmitry_Bivol",
		"Division": "Light-heavyweight",
		"Des" : "At the top of the year, Bivol wasn’t on the radar at all for a spot on the top 10 pound-for-pound rankings. But when you put a chink in the armor of Canelo Alvarez, defeating him in a title bout, you earn yourself a spot on the list. Bivol controlled the terms of engagement from the onset against Alvarez, pulling off one of the more surprising wins in the last few years. But a message was also sent by Bivol, not only to Alvarez, but to the boxing world as a whole: he is here to stay. Another matchup between the two could happen in 2023, but as of right now Alvarez is slated to face GGG next. Regardless, Bivol has the biggest win of the year thus far in boxing, and his stock is quickly rising.",
		"IsVisible" : false
	},
	{
		"Title": "10. Jermell Charlo",
		"Pic" : "Jermell_Charlo",
		"Division": "Light-middleweight",
		"Des" : "It’s been a long time coming for a spot in the top 10 for Jermell Charlo, who has long been recognized as one of the more talented fighters in the sport, but hadn’t quite put it all together yet to make his way into the conversations regarding the best of the best. After a 2018 loss to Tony Harrison where he lost his WBC light middleweight title, Charlo has been locked in on his way to becoming the undisputed light middleweight champion of the world. He avenged his loss against Harrison in 2019 to regain his WBC title, before knocking off Jeison Rosario and most recently Brian Castaño to become sole owner of all of the belts in the division. The WBO has now ordered Charlo to defend his title against Tim Tszyu, but before that happens Charlo has earned his placement in the top 10 after a long climb towards elite status.",
		"IsVisible" : false
	}
]